; domain
;; Woodworking
;;

(define (domain woodworking)
  (:requirements :typing :action-costs)
  (:types
      acolour awood woodobj machine 
      surface treatmentstatus
      aboardsize apartsize - object
      highspeed-saw glazer grinder immersion-varnisher
      planer saw spray-varnisher - machine
      board part - woodobj)

  (:constants
              verysmooth smooth rough - surface
              varnished glazed untreated colourfragments - treatmentstatus
              natural - acolour
              small medium large - apartsize)

  (:predicates 
            (unused ?obj - part)
            (available ?obj - woodobj)

            (surface-condition ?obj - woodobj ?surface - surface)
            (treatment ?obj - part ?treatment - treatmentstatus)
            (colour ?obj - part ?colour - acolour)
            (wood ?obj - woodobj ?wood - awood)
            (boardsize ?board - board ?size - aboardsize)
            (goalsize ?part - part ?size - apartsize)
            (boardsize-successor ?size1 ?size2 - aboardsize)

            (in-highspeed-saw ?b - board ?m - highspeed-saw)
            (empty ?m - highspeed-saw)
            (has-colour ?machine - machine ?colour - acolour)
            (contains-part ?b - board ?p - part)
            (grind-treatment-change ?old ?new - treatmentstatus)
            (is-smooth ?surface - surface))
      
  (:functions (total-cost) - number
            (spray-varnish-cost ?obj - part) - number
            (glaze-cost ?obj - part) - number
            (grind-cost ?obj - part) - number
            (plane-cost ?obj - part) - number)

  (:action do-immersion-varnish
    :parameters (?x - part ?m - immersion-varnisher 
                 ?newcolour - acolour ?surface - surface)
    :precondition (and
            (available ?x)
            (has-colour ?m ?newcolour)
            (surface-condition ?x ?surface)
            (is-smooth ?surface)
            (treatment ?x untreated))
    :effect (and
            (increase (total-cost) 10)
            (not (treatment ?x untreated))
            (treatment ?x varnished)
            (not (colour ?x natural))
            (colour ?x ?newcolour)))

  (:action do-spray-varnish
    :parameters (?x - part ?m - spray-varnisher 
                 ?newcolour - acolour ?surface - surface)
    :precondition (and
            (available ?x)
            (has-colour ?m ?newcolour)
            (surface-condition ?x ?surface)
            (is-smooth ?surface)
            (treatment ?x untreated))
    :effect (and 
            (increase (total-cost) (spray-varnish-cost ?x))
            (not (treatment ?x untreated))
            (treatment ?x varnished)
            (not (colour ?x natural))
            (colour ?x ?newcolour)))

  (:action do-glaze
    :parameters (?x - part ?m - glazer 
                 ?newcolour - acolour)
    :precondition (and
            (available ?x)
            (has-colour ?m ?newcolour)
            (treatment ?x untreated))
    :effect (and 
            (increase (total-cost) (glaze-cost ?x))
            (not (treatment ?x untreated))
            (treatment ?x glazed)
            (not (colour ?x natural))
            (colour ?x ?newcolour)))

  (:action do-grind
    :parameters (?x - part ?m - grinder ?oldsurface - surface
                 ?oldcolour - acolour 
                 ?oldtreatment ?newtreatment - treatmentstatus) 
    :precondition (and 
            (available ?x)
            (surface-condition ?x ?oldsurface)
            (is-smooth ?oldsurface)
            (colour ?x ?oldcolour)
            (treatment ?x ?oldtreatment)
            (grind-treatment-change ?oldtreatment ?newtreatment))
    :effect (and
            (increase (total-cost) (grind-cost ?x))
            (not (surface-condition ?x ?oldsurface))
            (surface-condition ?x verysmooth)
            (not (treatment ?x ?oldtreatment))
            (treatment ?x ?newtreatment)
            (not (colour ?x ?oldcolour))
            (colour ?x natural)))

  (:action do-plane
    :parameters (?x - part ?m - planer ?oldsurface - surface
                 ?oldcolour - acolour ?oldtreatment - treatmentstatus) 
    :precondition (and 
            (available ?x)
            (surface-condition ?x ?oldsurface)
            (treatment ?x ?oldtreatment)
            (colour ?x ?oldcolour))
    :effect (and
            (increase (total-cost) (plane-cost ?x))
            (not (surface-condition ?x ?oldsurface))
            (surface-condition ?x smooth)
            (not (treatment ?x ?oldtreatment))
            (treatment ?x untreated)
            (not (colour ?x ?oldcolour))
            (colour ?x natural)))

  (:action load-highspeed-saw
    :parameters (?b - board ?m - highspeed-saw)
    :precondition (and
            (empty ?m)
            (available ?b))
    :effect (and
            (increase (total-cost) 30)
            (not (available ?b))
            (not (empty ?m))
            (in-highspeed-saw ?b ?m)))
            
  (:action unload-highspeed-saw
    :parameters (?b - board ?m - highspeed-saw)
    :precondition (in-highspeed-saw ?b ?m)
    :effect (and
            (increase (total-cost) 10)
            (available ?b)
            (not (in-highspeed-saw ?b ?m))
            (empty ?m)))
            
  (:action cut-board-small
    :parameters (?b - board ?p - part ?m - highspeed-saw ?w - awood
                 ?surface - surface ?size_before ?size_after - aboardsize)
    :precondition (and
            (unused ?p)
            (goalsize ?p small)
            (in-highspeed-saw ?b ?m)
            (wood ?b ?w)
            (surface-condition ?b ?surface)
            (boardsize ?b ?size_before)
            (boardsize-successor ?size_after ?size_before))
    :effect (and
            (increase (total-cost) 10)
            (not (unused ?p))
            (available ?p)
            (wood ?p ?w)
            (surface-condition ?p ?surface)
            (colour ?p natural)
            (treatment ?p untreated)
            (boardsize ?b ?size_after)))

  (:action cut-board-medium
    :parameters (?b - board ?p - part ?m - highspeed-saw ?w - awood
                 ?surface - surface 
                 ?size_before ?s1 ?size_after - aboardsize)
    :precondition (and
            (unused ?p)
            (goalsize ?p medium)
            (in-highspeed-saw ?b ?m)
            (wood ?b ?w)
            (surface-condition ?b ?surface)
            (boardsize ?b ?size_before)
            (boardsize-successor ?size_after ?s1)
            (boardsize-successor ?s1 ?size_before))
    :effect (and
            (increase (total-cost) 10)
            (not (unused ?p))
            (available ?p)
            (wood ?p ?w)
            (surface-condition ?p ?surface)
            (colour ?p natural)
            (treatment ?p untreated)
            (boardsize ?b ?size_after)))

  (:action cut-board-large
    :parameters (?b - board ?p - part ?m - highspeed-saw ?w - awood
                 ?surface - surface 
                 ?size_before ?s1 ?s2 ?size_after - aboardsize)
    :precondition (and
            (unused ?p)
            (goalsize ?p large)
            (in-highspeed-saw ?b ?m)
            (wood ?b ?w)
            (surface-condition ?b ?surface)
            (boardsize ?b ?size_before)
            (boardsize-successor ?size_after ?s1)
            (boardsize-successor ?s1 ?s2)
            (boardsize-successor ?s2 ?size_before))
    :effect (and
            (increase (total-cost) 10)
            (not (unused ?p))
            (available ?p)
            (wood ?p ?w)
            (surface-condition ?p ?surface)
            (colour ?p natural)
            (treatment ?p untreated)
            (boardsize ?b ?size_after)))

  (:action do-saw-small
    :parameters (?b - board ?p - part ?m - saw ?w - awood
                 ?surface - surface ?size_before ?size_after - aboardsize) 
    :precondition (and 
            (unused ?p)
            (goalsize ?p small)
            (available ?b)
            (wood ?b ?w)
            (surface-condition ?b ?surface)
            (boardsize ?b ?size_before)
            (boardsize-successor ?size_after ?size_before))
    :effect (and
            (increase (total-cost) 30)
            (not (unused ?p))
            (available ?p)
            (wood ?p ?w)
            (surface-condition ?p ?surface)
            (colour ?p natural) 
            (treatment ?p untreated)
            (boardsize ?b ?size_after)))

  (:action do-saw-medium
    :parameters (?b - board ?p - part ?m - saw ?w - awood
                 ?surface - surface 
                 ?size_before ?s1 ?size_after - aboardsize) 
    :precondition (and 
            (unused ?p)
            (goalsize ?p medium)
            (available ?b)
            (wood ?b ?w)
            (surface-condition ?b ?surface)
            (boardsize ?b ?size_before)
            (boardsize-successor ?size_after ?s1)
            (boardsize-successor ?s1 ?size_before))
    :effect (and
            (increase (total-cost) 30)
            (not (unused ?p))
            (available ?p)
            (wood ?p ?w)
            (surface-condition ?p ?surface)
            (colour ?p natural) 
            (treatment ?p untreated)
            (boardsize ?b ?size_after)))

  (:action do-saw-large
    :parameters (?b - board ?p - part ?m - saw ?w - awood
                 ?surface - surface 
                 ?size_before ?s1 ?s2 ?size_after - aboardsize) 
    :precondition (and 
            (unused ?p)
            (goalsize ?p large)
            (available ?b)
            (wood ?b ?w)
            (surface-condition ?b ?surface)
            (boardsize ?b ?size_before)
            (boardsize-successor ?size_after ?s1)
            (boardsize-successor ?s1 ?s2)
            (boardsize-successor ?s2 ?size_before))
    :effect (and
            (increase (total-cost) 30)
            (not (unused ?p))
            (available ?p)
            (wood ?p ?w)
            (surface-condition ?p ?surface)
            (colour ?p natural) 
            (treatment ?p untreated)
            (boardsize ?b ?size_after)))
)

; problem
; woodworking task with 15 parts and 125% wood
; Machines:
;   1 highspeed-saw
;   1 glazer
;   1 grinder
;   1 immersion-varnisher
;   1 planer
;   1 saw
;   1 spray-varnisher

(define (problem wood-prob)
  (:domain woodworking)
  (:objects
    highspeed-saw0 - highspeed-saw
    glazer0 - glazer
    grinder0 - grinder
    immersion-varnisher0 - immersion-varnisher
    planer0 - planer
    saw0 - saw
    spray-varnisher0 - spray-varnisher
    green black mauve blue red white - acolour
    oak beech teak mahogany - awood
    p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 p13 p14 - part
    b0 b1 b2 b3 b4 b5 - board
    s0 s1 s2 s3 s4 s5 s6 s7 s8 s9 s10 - aboardsize
  )
  (:init
    (grind-treatment-change varnished colourfragments)
    (grind-treatment-change glazed untreated)
    (grind-treatment-change untreated untreated)
    (grind-treatment-change colourfragments untreated)
    (is-smooth smooth)
    (is-smooth verysmooth)
    (= (total-cost) 0)
    (boardsize-successor s0 s1)
    (boardsize-successor s1 s2)
    (boardsize-successor s2 s3)
    (boardsize-successor s3 s4)
    (boardsize-successor s4 s5)
    (boardsize-successor s5 s6)
    (boardsize-successor s6 s7)
    (boardsize-successor s7 s8)
    (boardsize-successor s8 s9)
    (boardsize-successor s9 s10)
    (empty highspeed-saw0)
    (has-colour glazer0 red)
    (has-colour glazer0 mauve)
    (has-colour glazer0 natural)
    (has-colour glazer0 green)
    (has-colour glazer0 black)
    (has-colour glazer0 white)
    (has-colour immersion-varnisher0 black)
    (has-colour immersion-varnisher0 mauve)
    (has-colour immersion-varnisher0 white)
    (has-colour spray-varnisher0 black)
    (has-colour spray-varnisher0 mauve)
    (has-colour spray-varnisher0 white)
    (unused p0)
    (goalsize p0 small)
    (= (spray-varnish-cost p0) 5)
    (= (glaze-cost p0) 10)
    (= (grind-cost p0) 15)
    (= (plane-cost p0) 10)
    (unused p1)
    (goalsize p1 large)
    (= (spray-varnish-cost p1) 15)
    (= (glaze-cost p1) 20)
    (= (grind-cost p1) 45)
    (= (plane-cost p1) 30)
    (available p2)
    (treatment p2 varnished)
    (surface-condition p2 rough)
    (wood p2 beech)
    (colour p2 black)
    (goalsize p2 medium)
    (= (spray-varnish-cost p2) 10)
    (= (glaze-cost p2) 15)
    (= (grind-cost p2) 30)
    (= (plane-cost p2) 20)
    (unused p3)
    (goalsize p3 medium)
    (= (spray-varnish-cost p3) 10)
    (= (glaze-cost p3) 15)
    (= (grind-cost p3) 30)
    (= (plane-cost p3) 20)
    (unused p4)
    (goalsize p4 small)
    (= (spray-varnish-cost p4) 5)
    (= (glaze-cost p4) 10)
    (= (grind-cost p4) 15)
    (= (plane-cost p4) 10)
    (available p5)
    (treatment p5 colourfragments)
    (surface-condition p5 verysmooth)
    (wood p5 beech)
    (colour p5 blue)
    (goalsize p5 medium)
    (= (spray-varnish-cost p5) 10)
    (= (glaze-cost p5) 15)
    (= (grind-cost p5) 30)
    (= (plane-cost p5) 20)
    (unused p6)
    (goalsize p6 large)
    (= (spray-varnish-cost p6) 15)
    (= (glaze-cost p6) 20)
    (= (grind-cost p6) 45)
    (= (plane-cost p6) 30)
    (unused p7)
    (goalsize p7 medium)
    (= (spray-varnish-cost p7) 10)
    (= (glaze-cost p7) 15)
    (= (grind-cost p7) 30)
    (= (plane-cost p7) 20)
    (unused p8)
    (goalsize p8 medium)
    (= (spray-varnish-cost p8) 10)
    (= (glaze-cost p8) 15)
    (= (grind-cost p8) 30)
    (= (plane-cost p8) 20)
    (unused p9)
    (goalsize p9 small)
    (= (spray-varnish-cost p9) 5)
    (= (glaze-cost p9) 10)
    (= (grind-cost p9) 15)
    (= (plane-cost p9) 10)
    (unused p10)
    (goalsize p10 medium)
    (= (spray-varnish-cost p10) 10)
    (= (glaze-cost p10) 15)
    (= (grind-cost p10) 30)
    (= (plane-cost p10) 20)
    (unused p11)
    (goalsize p11 small)
    (= (spray-varnish-cost p11) 5)
    (= (glaze-cost p11) 10)
    (= (grind-cost p11) 15)
    (= (plane-cost p11) 10)
    (unused p12)
    (goalsize p12 medium)
    (= (spray-varnish-cost p12) 10)
    (= (glaze-cost p12) 15)
    (= (grind-cost p12) 30)
    (= (plane-cost p12) 20)
    (available p13)
    (treatment p13 colourfragments)
    (surface-condition p13 rough)
    (wood p13 oak)
    (colour p13 green)
    (goalsize p13 small)
    (= (spray-varnish-cost p13) 5)
    (= (glaze-cost p13) 10)
    (= (grind-cost p13) 15)
    (= (plane-cost p13) 10)
    (unused p14)
    (goalsize p14 large)
    (= (spray-varnish-cost p14) 15)
    (= (glaze-cost p14) 20)
    (= (grind-cost p14) 45)
    (= (plane-cost p14) 30)
    (boardsize b0 s7)
    (wood b0 beech)
    (surface-condition b0 rough)
    (available b0)
    (boardsize b1 s3)
    (wood b1 beech)
    (surface-condition b1 rough)
    (available b1)
    (boardsize b2 s10)
    (wood b2 teak)
    (surface-condition b2 smooth)
    (available b2)
    (boardsize b3 s2)
    (wood b3 teak)
    (surface-condition b3 smooth)
    (available b3)
    (boardsize b4 s7)
    (wood b4 oak)
    (surface-condition b4 rough)
    (available b4)
    (boardsize b5 s2)
    (wood b5 mahogany)
    (surface-condition b5 rough)
    (available b5)
  )
  (:goal
    (and
    (available p0)
    (wood p0 beech)
    (treatment p0 varnished)
    (available p1)
    (wood p1 teak)
    (colour p1 black)
    (available p2)
    (wood p2 beech)
    (treatment p2 glazed)
    (colour p2 red)
    (surface-condition p2 smooth)
    (available p3)
    (wood p3 oak)
    (treatment p3 glazed)
    (colour p3 mauve)
    (available p4)
    (wood p4 beech)
    (treatment p4 glazed)
    (colour p4 black)
    (surface-condition p4 verysmooth)
    (available p5)
    (wood p5 beech)
    (treatment p5 glazed)
    (colour p5 black)
    (surface-condition p5 verysmooth)
    (available p6)
    (wood p6 oak)
    (surface-condition p6 smooth)
    (available p7)
    (wood p7 beech)
    (treatment p7 glazed)
    (colour p7 natural)
    (surface-condition p7 smooth)
    (available p8)
    (wood p8 teak)
    (treatment p8 glazed)
    (colour p8 green)
    (surface-condition p8 smooth)
    (available p9)
    (treatment p9 glazed)
    (surface-condition p9 verysmooth)
    (available p10)
    (treatment p10 glazed)
    (surface-condition p10 smooth)
    (available p11)
    (wood p11 mahogany)
    (surface-condition p11 smooth)
    (available p12)
    (wood p12 teak)
    (treatment p12 varnished)
    (colour p12 mauve)
    (surface-condition p12 verysmooth)
    (available p13)
    (wood p13 oak)
    (colour p13 white)
    (surface-condition p13 smooth)
    (available p14)
    (treatment p14 glazed)
    (surface-condition p14 verysmooth)
    )
  )
  (:metric minimize (total-cost))
)

; plan
1. (do-saw-small b0 p4 saw0 beech rough s7 s6)
   deleted: (unused p4)
   added: (available p4) (wood p4 beech) (surface-condition p4 rough) (colour p4 natural) (treatment p4 untreated) (boardsize b0 s6)
   goals met: 9 of 59
2. (do-saw-medium b4 p3 saw0 oak rough s7 s6 s5)
   deleted: (unused p3)
   added: (available p3) (wood p3 oak) (surface-condition p3 rough) (colour p3 natural) (treatment p3 untreated) (boardsize b4 s5)
   goals met: 11 of 59
3. (do-saw-medium b2 p8 saw0 teak smooth s10 s9 s8)
   deleted: (unused p8)
   added: (available p8) (wood p8 teak) (surface-condition p8 smooth) (colour p8 natural) (treatment p8 untreated) (boardsize b2 s8)
   goals met: 14 of 59
4. (do-saw-medium b2 p10 saw0 teak smooth s8 s7 s6)
   deleted: (unused p10)
   added: (available p10) (wood p10 teak) (surface-condition p10 smooth) (colour p10 natural) (treatment p10 untreated) (boardsize b2 s6)
   goals met: 16 of 59
5. (do-saw-large b2 p14 saw0 teak smooth s6 s4 s5 s3)
   deleted: (unused p14)
   added: (available p14) (wood p14 teak) (surface-condition p14 smooth) (colour p14 natural) (treatment p14 untreated) (boardsize b2 s3)
   goals met: 17 of 59
6. (do-saw-large b2 p1 saw0 teak smooth s3 s1 s2 s0)
   deleted: (unused p1)
   added: (available p1) (wood p1 teak) (surface-condition p1 smooth) (colour p1 natural) (treatment p1 untreated) (boardsize b2 s0)
   goals met: 19 of 59
7. (do-plane p4 planer0 rough natural untreated)
   deleted: (surface-condition p4 rough)
   added: (surface-condition p4 smooth)
   goals met: 19 of 59
8. (do-plane p2 planer0 rough black varnished)
   deleted: (surface-condition p2 rough) (treatment p2 varnished) (colour p2 black)
   added: (surface-condition p2 smooth) (treatment p2 untreated) (colour p2 natural)
   goals met: 20 of 59
9. (do-plane p13 planer0 rough green colourfragments)
   deleted: (surface-condition p13 rough) (treatment p13 colourfragments) (colour p13 green)
   added: (surface-condition p13 smooth) (treatment p13 untreated) (colour p13 natural)
   goals met: 21 of 59
10. (do-grind p5 grinder0 verysmooth blue colourfragments untreated)
   deleted: (treatment p5 colourfragments) (colour p5 blue)
   added: (treatment p5 untreated) (colour p5 natural)
   goals met: 21 of 59
11. (do-grind p4 grinder0 smooth natural untreated untreated)
   deleted: (surface-condition p4 smooth)
   added: (surface-condition p4 verysmooth)
   goals met: 22 of 59
12. (do-grind p14 grinder0 smooth natural untreated untreated)
   deleted: (surface-condition p14 smooth)
   added: (surface-condition p14 verysmooth)
   goals met: 23 of 59
13. (do-glaze p8 glazer0 green)
   deleted: (treatment p8 untreated) (colour p8 natural)
   added: (treatment p8 glazed) (colour p8 green)
   goals met: 25 of 59
14. (do-glaze p5 glazer0 black)
   deleted: (treatment p5 untreated) (colour p5 natural)
   added: (treatment p5 glazed) (colour p5 black)
   goals met: 27 of 59
15. (do-glaze p4 glazer0 black)
   deleted: (treatment p4 untreated) (colour p4 natural)
   added: (treatment p4 glazed) (colour p4 black)
   goals met: 29 of 59
16. (do-glaze p3 glazer0 mauve)
   deleted: (treatment p3 untreated) (colour p3 natural)
   added: (treatment p3 glazed) (colour p3 mauve)
   goals met: 31 of 59
17. (do-glaze p2 glazer0 red)
   deleted: (treatment p2 untreated) (colour p2 natural)
   added: (treatment p2 glazed) (colour p2 red)
   goals met: 33 of 59
18. (do-glaze p14 glazer0 black)
   deleted: (treatment p14 untreated) (colour p14 natural)
   added: (treatment p14 glazed) (colour p14 black)
   goals met: 34 of 59
19. (do-glaze p13 glazer0 white)
   deleted: (treatment p13 untreated) (colour p13 natural)
   added: (treatment p13 glazed) (colour p13 white)
   goals met: 35 of 59
20. (do-glaze p10 glazer0 black)
   deleted: (treatment p10 untreated) (colour p10 natural)
   added: (treatment p10 glazed) (colour p10 black)
   goals met: 36 of 59
21. (do-glaze p1 glazer0 black)
   deleted: (treatment p1 untreated) (colour p1 natural)
   added: (treatment p1 glazed) (colour p1 black)
   goals met: 37 of 59
22. (do-saw-large b4 p6 saw0 oak rough s5 s3 s4 s2)
   deleted: (unused p6)
   added: (available p6) (wood p6 oak) (surface-condition p6 rough) (colour p6 natural) (treatment p6 untreated) (boardsize b4 s2)
   goals met: 39 of 59
23. (do-plane p6 planer0 rough natural untreated)
   deleted: (surface-condition p6 rough)
   added: (surface-condition p6 smooth)
   goals met: 40 of 59
24. (do-saw-medium b0 p7 saw0 beech rough s6 s5 s4)
   deleted: (unused p7)
   added: (available p7) (wood p7 beech) (surface-condition p7 rough) (colour p7 natural) (treatment p7 untreated) (boardsize b0 s4)
   goals met: 43 of 59
25. (do-plane p7 planer0 rough natural untreated)
   deleted: (surface-condition p7 rough)
   added: (surface-condition p7 smooth)
   goals met: 44 of 59
26. (do-glaze p7 glazer0 natural)
   deleted: (treatment p7 untreated)
   added: (treatment p7 glazed)
   goals met: 45 of 59
27. (do-saw-medium b3 p12 saw0 teak smooth s2 s1 s0)
   deleted: (unused p12)
   added: (available p12) (wood p12 teak) (surface-condition p12 smooth) (colour p12 natural) (treatment p12 untreated) (boardsize b3 s0)
   goals met: 47 of 59
28. (do-grind p12 grinder0 smooth natural untreated untreated)
   deleted: (surface-condition p12 smooth)
   added: (surface-condition p12 verysmooth)
   goals met: 48 of 59
29. (do-immersion-varnish p12 immersion-varnisher0 mauve verysmooth)
   deleted: (treatment p12 untreated) (colour p12 natural)
   added: (treatment p12 varnished) (colour p12 mauve)
   goals met: 50 of 59
30. (do-saw-small b0 p0 saw0 beech rough s4 s3)
   deleted: (unused p0)
   added: (available p0) (wood p0 beech) (surface-condition p0 rough) (colour p0 natural) (treatment p0 untreated) (boardsize b0 s3)
   goals met: 52 of 59
31. (do-plane p0 planer0 rough natural untreated)
   deleted: (surface-condition p0 rough)
   added: (surface-condition p0 smooth)
   goals met: 52 of 59
32. (do-immersion-varnish p0 immersion-varnisher0 black smooth)
   deleted: (treatment p0 untreated) (colour p0 natural)
   added: (treatment p0 varnished) (colour p0 black)
   goals met: 53 of 59
33. (do-saw-small b0 p9 saw0 beech rough s3 s2)
   deleted: (unused p9)
   added: (available p9) (wood p9 beech) (surface-condition p9 rough) (colour p9 natural) (treatment p9 untreated) (boardsize b0 s2)
   goals met: 54 of 59
34. (do-plane p9 planer0 rough natural untreated)
   deleted: (surface-condition p9 rough)
   added: (surface-condition p9 smooth)
   goals met: 54 of 59
35. (do-grind p9 grinder0 smooth natural untreated untreated)
   deleted: (surface-condition p9 smooth)
   added: (surface-condition p9 verysmooth)
   goals met: 55 of 59
36. (do-glaze p9 glazer0 black)
   deleted: (treatment p9 untreated) (colour p9 natural)
   added: (treatment p9 glazed) (colour p9 black)
   goals met: 56 of 59
37. (do-saw-small b5 p11 saw0 mahogany rough s2 s1)
   deleted: (unused p11)
   added: (available p11) (wood p11 mahogany) (surface-condition p11 rough) (colour p11 natural) (treatment p11 untreated) (boardsize b5 s1)
   goals met: 58 of 59
38. (do-plane p11 planer0 rough natural untreated)
   deleted: (surface-condition p11 rough)
   added: (surface-condition p11 smooth)
   goals met: 59 of 59
